import photo from '@/shared/assets/icons/peopleTalk/MaskGroup.png';
import image from '@/shared/assets/icons/peopleTalk/Group 1321315710.png';

export const peopleTalk = [
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 1',
    infoText: 'Домовладелец',
  },
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 2',
    infoText: 'Домовладелец',
  },
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 3',
    infoText: 'Домовладелец',
  },
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 4',
    infoText: 'Домовладелец',
  },
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 5',
    infoText: 'Домовладелец',
  },
  {
    photo: photo,
    image: image,
    avatar: photo,
    text:
      'Опыт работы более 10 лет! Построенные объекты и довольные клиенты говорят' +
      ' сами за себя! Каждому клиенту предлагается экскурсия по уже завершённым' +
      ' проектам — вы лично убедитесь в качестве наших работ.\n' +
      'Мы сопровождаем клиента на всех этапах — от консультации ' +
      'и проектирования до сдачи объекта «под ключ».' +
      ' Используем только проверенные материалы и современные технологии ' +
      'строительства. Индивидуальный подход, прозрачность в работе и строгое' +
      ' соблюдение сроков — вот что делает нас надёжным партнёром в реализации вашего проекта.\n' +
      'Нам доверяют семьи, бизнес и застройщики — потому что мы строим, как для себя!\n' +
      'Участникам СВО предоставляем скидки.',
    name: 'Пантелеймон\n' + 'Христорождественский 6',
    infoText: 'Домовладелец',
  },
];
