import { EServiceName, type TData } from '@/pages/service/types/type.ts';

export const data: TData = {
  [EServiceName.countryHousesConstruction]: {
    mainTitle: { text: "'О компании'" },
    leftLineText: {
      text: 'Cтроительство деревянных домов.\n' + 'Деревянные дома под ключ',
    },
    boldTitle: {
      text: 'Деревянные дома во Владимире и Владимирской области под ключ. Цены на строительство',
    },
    text: {
      text:
        'Строительство деревянных домов становится довольно востребованным во всех регионах.' +
        ' Это происходи за счет большого количества преимуществ этих' +
        ' строений. Прежде всего, деревянные дома привлекают  тем,' +
        ' что являются экологически чистыми.' +
        ' Кроме того, при заказе строительства деревянного дома, можно выбрать' +
        ' один из актуальных способов оформления строения. Однако,' +
        ' этот вид возведения домов имеет свои особенности.\n\n' +
        'Прежде всего, это объясняется особым свойством древесины,' +
        ' которая требует к себе тщательного внимания.' +
        ' Например, деревянные дома обладают свойством' +
        ' усадки, которое представляет собой уменьшение объемов строения за счет испарения влаги.',
    },
    title: {
      text: '1. Создание проекта деревянного дома и его согласование',
    },
    dotsText: {
      text: [
        'Осмотр и анализ территории, на которой будет возведен дом.',
        'Измерение всех необходимых параметров.',
        '',
        'Четкое распределение всех объектов.',
      ],
    },
    alertText: {
      text: 'Если пренебречь данными правилами и завершить строительство в один этап, то в дальнейшем вы можете столкнуться с серьезными проблемами.',
    },
    numberText: {
      text: [
        'Для того чтобы создать действительно качественное',
        ' и износостойкое строение, необходимо более внимательно подходить' +
          '  как это вряд ли говорит о высоком профессионализме сотрудников.',
      ],
    },
    boxText: {
      text: 'Для того чтобы создать действительно качественное и износостойкое строение, необходимо более внимательно подходить к выбору строительных материалов. При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
      title: 'Заголовок',
    },
    imageTitleText: {
      text:
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.\n' +
        'Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить  на стройматериалах.\n',
      title:
        'Изображение с текстом + Заголовок  H2\n' +
        'может быть длинным  и писаться в две строки ',
      image: '1.png',
    },
    bigImageAndTitle: {
      image: '1.png',
      title: 'Большое изображаение с заголовком ',
      underText: 'Стиль подписи под изображением',
    },
    gallery: {
      images: [
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
      ],
    },
    table: {
      data: [
        ['Параметр', 'Значение', 'Значение', 'Значение', 'Значение'],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
      ],
    },
    faq: {
      data: [
        [
          'Стоимость услуги?',
          'При заказе строительства деревянных домов в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар. Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить на стройматериалах.',
        ],
        ['Каковы нормы?', 'Ответ...'],
        ['Возврат', 'Ответ...'],
      ],
    },
    promoSection: {
      data: [
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
      ],
    },
  },
  [EServiceName.extensionsConstruction]: {
    mainTitle: { text: "'О компании'" },
    leftLineText: {
      text: 'Cтроительство деревянных домов.\n' + 'Деревянные дома под ключ',
    },
    boldTitle: {
      text: 'Деревянные дома во Владимире и Владимирской области под ключ. Цены на строительство',
    },
    text: {
      text:
        'Строительство деревянных домов становится довольно востребованным во всех регионах.' +
        ' Это происходи за счет большого количества преимуществ этих' +
        ' строений. Прежде всего, деревянные дома привлекают  тем,' +
        ' что являются экологически чистыми.' +
        ' Кроме того, при заказе строительства деревянного дома, можно выбрать' +
        ' один из актуальных способов оформления строения. Однако,' +
        ' этот вид возведения домов имеет свои особенности.\n\n' +
        'Прежде всего, это объясняется особым свойством древесины,' +
        ' которая требует к себе тщательного внимания.' +
        ' Например, деревянные дома обладают свойством' +
        ' усадки, которое представляет собой уменьшение объемов строения за счет испарения влаги.',
    },
    title: {
      text: '1. Создание проекта деревянного дома и его согласование',
    },
    dotsText: {
      text: [
        'Осмотр и анализ территории, на которой будет возведен дом.',
        'Измерение всех необходимых параметров.',
        '',
        'Четкое распределение всех объектов.',
      ],
    },
    alertText: {
      text: 'Если пренебречь данными правилами и завершить строительство в один этап, то в дальнейшем вы можете столкнуться с серьезными проблемами.',
    },
    numberText: {
      text: [
        'Для того чтобы создать действительно качественное',
        ' и износостойкое строение, необходимо более внимательно подходить' +
          '  как это вряд ли говорит о высоком профессионализме сотрудников.',
      ],
    },
    boxText: {
      text: 'Для того чтобы создать действительно качественное и износостойкое строение, необходимо более внимательно подходить к выбору строительных материалов. При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
    },
    imageTitleText: {
      text:
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.\n' +
        'Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить  на стройматериалах.\n',
      title:
        'Изображение с текстом + Заголовок  H2\n' +
        'может быть длинным  и писаться в две строки ',
      image: '1.png',
    },
    bigImageAndTitle: {
      image: '1.png',
      title: 'Большое изображаение с заголовком ',
      underText: 'Стиль подписи под изображением',
    },
    gallery: {
      images: [
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
      ],
    },
    table: {
      data: [
        ['Параметр', 'Значение', 'Значение', 'Значение', 'Значение'],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
      ],
    },
    faq: {
      data: [
        [
          'Стоимость услуги?',
          'При заказе строительства деревянных домов в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар. Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить на стройматериалах.',
        ],
        ['Каковы нормы?', 'Ответ...'],
        ['Возврат', 'Ответ...'],
      ],
    },
    promoSection: {
      data: [
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
      ],
    },
  },
  [EServiceName.gazebosConstruction]: {
    mainTitle: { text: "'О компании'" },
    leftLineText: {
      text: 'Cтроительство деревянных домов.\n' + 'Деревянные дома под ключ',
    },
    boldTitle: {
      text: 'Деревянные дома во Владимире и Владимирской области под ключ. Цены на строительство',
    },
    text: {
      text:
        'Строительство деревянных домов становится довольно востребованным во всех регионах.' +
        ' Это происходи за счет большого количества преимуществ этих' +
        ' строений. Прежде всего, деревянные дома привлекают  тем,' +
        ' что являются экологически чистыми.' +
        ' Кроме того, при заказе строительства деревянного дома, можно выбрать' +
        ' один из актуальных способов оформления строения. Однако,' +
        ' этот вид возведения домов имеет свои особенности.\n\n' +
        'Прежде всего, это объясняется особым свойством древесины,' +
        ' которая требует к себе тщательного внимания.' +
        ' Например, деревянные дома обладают свойством' +
        ' усадки, которое представляет собой уменьшение объемов строения за счет испарения влаги.',
    },
    title: {
      text: '1. Создание проекта деревянного дома и его согласование',
    },
    dotsText: {
      text: [
        'Осмотр и анализ территории, на которой будет возведен дом.',
        'Измерение всех необходимых параметров.',
        '',
        'Четкое распределение всех объектов.',
      ],
    },
    alertText: {
      text: 'Если пренебречь данными правилами и завершить строительство в один этап, то в дальнейшем вы можете столкнуться с серьезными проблемами.',
    },
    numberText: {
      text: [
        'Для того чтобы создать действительно качественное',
        ' и износостойкое строение, необходимо более внимательно подходить' +
          '  как это вряд ли говорит о высоком профессионализме сотрудников.',
      ],
    },
    boxText: {
      text: 'Для того чтобы создать действительно качественное и износостойкое строение, необходимо более внимательно подходить к выбору строительных материалов. При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
    },
    imageTitleText: {
      text:
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.\n' +
        'Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить  на стройматериалах.\n',
      title:
        'Изображение с текстом + Заголовок  H2\n' +
        'может быть длинным  и писаться в две строки ',
      image: '1.png',
    },
    bigImageAndTitle: {
      image: '1.png',
      title: 'Большое изображаение с заголовком ',
      underText: 'Стиль подписи под изображением',
    },
    gallery: {
      images: [
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
      ],
    },
    table: {
      data: [
        ['Параметр', 'Значение', 'Значение', 'Значение', 'Значение'],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
      ],
    },
    faq: {
      data: [
        [
          'Стоимость услуги?',
          'При заказе строительства деревянных домов в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар. Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить на стройматериалах.',
        ],
        ['Каковы нормы?', 'Ответ...'],
        ['Возврат', 'Ответ...'],
      ],
    },
    promoSection: {
      data: [
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
      ],
    },
  },
  [EServiceName.reconstruction]: {
    mainTitle: { text: "'О компании'" },
    leftLineText: {
      text: 'Cтроительство деревянных домов.\n' + 'Деревянные дома под ключ',
    },
    boldTitle: {
      text: 'Деревянные дома во Владимире и Владимирской области под ключ. Цены на строительство',
    },
    text: {
      text:
        'Строительство деревянных домов становится довольно востребованным во всех регионах.' +
        ' Это происходи за счет большого количества преимуществ этих' +
        ' строений. Прежде всего, деревянные дома привлекают  тем,' +
        ' что являются экологически чистыми.' +
        ' Кроме того, при заказе строительства деревянного дома, можно выбрать' +
        ' один из актуальных способов оформления строения. Однако,' +
        ' этот вид возведения домов имеет свои особенности.\n\n' +
        'Прежде всего, это объясняется особым свойством древесины,' +
        ' которая требует к себе тщательного внимания.' +
        ' Например, деревянные дома обладают свойством' +
        ' усадки, которое представляет собой уменьшение объемов строения за счет испарения влаги.',
    },
    title: {
      text: '1. Создание проекта деревянного дома и его согласование',
    },
    dotsText: {
      text: [
        'Осмотр и анализ территории, на которой будет возведен дом.',
        'Измерение всех необходимых параметров.',
        '',
        'Четкое распределение всех объектов.',
      ],
    },
    alertText: {
      text: 'Если пренебречь данными правилами и завершить строительство в один этап, то в дальнейшем вы можете столкнуться с серьезными проблемами.',
    },
    numberText: {
      text: [
        'Для того чтобы создать действительно качественное',
        ' и износостойкое строение, необходимо более внимательно подходить' +
          '  как это вряд ли говорит о высоком профессионализме сотрудников.',
      ],
    },
    boxText: {
      text: 'Для того чтобы создать действительно качественное и износостойкое строение, необходимо более внимательно подходить к выбору строительных материалов. При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
    },
    imageTitleText: {
      text:
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.\n' +
        'Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить  на стройматериалах.\n',
      title:
        'Изображение с текстом + Заголовок  H2\n' +
        'может быть длинным  и писаться в две строки ',
      image: '1.png',
    },
    bigImageAndTitle: {
      image: '1.png',
      title: 'Большое изображаение с заголовком ',
      underText: 'Стиль подписи под изображением',
    },
    gallery: {
      images: [
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
        '1.png',
      ],
    },
    table: {
      data: [
        ['Параметр', 'Значение', 'Значение', 'Значение', 'Значение'],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
        [
          'Брус',
          '100x100',
          'Шлифовка и покраска',
          'Сборка срубов',
          'Какое-то значение',
        ],
      ],
    },
    faq: {
      data: [
        [
          'Стоимость услуги?',
          'При заказе строительства деревянных домов в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар. Особо важным этапом, предшествующим строительные работы, является составление сметы. Именно с помощью нее можно заранее распланировать бюджет всего строительства. Также грамотно составленная смета позволяет экономить на стройматериалах.',
        ],
        ['Каковы нормы?', 'Ответ...'],
        ['Возврат', 'Ответ...'],
      ],
    },
    promoSection: {
      data: [
        'При заказе строительства деревянных домов  в одной из компаний, вы можете воспользоваться услугой, при которой представитель строительной организации сопровождает клиента в магазин и помогает с выбором всей необходимой продукции. Специалисты имеют большой опыт в данном вопросе, поэтому без труда смогут определить качественный товар.',
      ],
    },
  },
};
