import icon1 from '@/shared/assets/icons/ourClientsPage/1.png';
import icon2 from '@/shared/assets/icons/ourClientsPage/2.png';
import icon3 from '@/shared/assets/icons/ourClientsPage/3.png';
import icon4 from '@/shared/assets/icons/ourClientsPage/4.png';
import icon5 from '@/shared/assets/icons/ourClientsPage/5.png';
import icon6 from '@/shared/assets/icons/ourClientsPage/6.png';

export const ourClients = [
  {
    icon: icon1,
    title: 'Узкая специализация – деревянное строительство',
    text:
      'Компания сосредоточена именно на работе с деревом, что гарантирует более высокий уровень качества,' +
      ' чем у универсальных подрядчиков.\n' +
      'Опытные мастера знают все нюансы усадки, вентиляции, защиты от влаги и насекомых в деревянных конструкциях.',
  },
  {
    icon: icon2,
    title: 'Индивидуальный подход',
    text:
      'Работа с частными клиентами позволяет гибко адаптировать проект под бюджет, стиль и нужды заказчика. ' +
      'Возможность реализовать нестандартные решения: эксклюзивные беседки, террасы, планировки дачных домов и пр.',
  },
  {
    icon: icon3,
    title: 'Быстрое принятие решений и контроль качества',
    text:
      'В отличие от крупных компаний, у нас нет бюрократии — решения принимаются оперативно,' +
      ' все процессы прозрачны.\n' +
      'Личный контроль владельца или прораба на каждом этапе работ.',
  },
  {
    icon: icon4,
    title: 'Конкурентные цены',
    text:
      'Отсутствие дорогой административной надстройки позволяет нам' +
      ' держать цену ниже, сохраняя при этом качество.\n' +
      'Гибкие схемы оплаты, возможность работы поэтапно.',
  },
  {
    icon: icon5,
    title: 'Полный цикл работ',
    text:
      'От проекта до отделки — можно заказать все работы «под ключ» у нашей компании,' +
      ' что упрощает коммуникацию и повышает ответственность.\n' +
      'Также выполняются реконструкции и ремонт уже существующих деревянных конструкций всех видов.',
  },
  {
    icon: icon6,
    title: 'Экологичность и традиции',
    text:
      'Акцент на экологически чистых материалах и традиционных технологиях деревянного домостроения.\n' +
      'Это особенно важно для загородных и дачных домов, где ценятся комфорт, натуральность и природное окружение.',
  },
];
